Revit 2024 API
AnalysisResultSchema.IsVisible Property
 If true analysis result is visible in view
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsVisible { get; set; }
Visual Basic
Public Property IsVisible As Boolean
	Get
	Set
Visual C++
public:
property bool IsVisible {
	bool get ();
	void set (bool value);
}
See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace